000_РОЗНИЦА_ЦЕНТР/src/Documents/МаркетинговаяАкция/МаркетинговаяАкция.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаркетинговаяАкция</name>
  <registerRecords>InformationRegister.ДействиеСкидокНаценок</registerRecords>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДляВсехМагазинов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляВсехМагазиновОдноРасписаниеСкидок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьИнтернетМагазин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеАкции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Магазины</name>
    <attributes>
      <name>Магазин</name>
      <type>
        <types>CatalogRef.Магазины</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкидкиНаценки</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Магазин</name>
      <type>
        <types>CatalogRef.Магазины</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаценка</name>
      <type>
        <types>CatalogRef.СкидкиНаценки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Добавление</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Удаление</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/НоменклатураСегмента/НоменклатураСегмента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НоменклатураСегмента</name>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сегмент</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ДатаИзмененияСегментов/ДатаИзмененияСегментов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатаИзмененияСегментов</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОбъектыДляОбработкиBigQuery/ОбъектыДляОбработкиBigQuery.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбъектыДляОбработкиBigQuery</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>action</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.РегистрацияПодсчетаПосетителей</types>
      <types>DocumentRef.МаркетинговаяАкция</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/СкидкиНаценки/СкидкиНаценки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СкидкиНаценки</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ПоследовательноеПрименение</name>
      <description>Последовательное применение</description>
        </content>
      </content>
    </items>
  </predefined>
  <attributes>
    <name>ВариантВыдачиКупона</name>
    <type>
      <types>EnumRef.ВариантыВыдачиКупона</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантСовместногоПрименения</name>
    <type>
      <types>EnumRef.ВариантыСовместногоПримененияСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСкидкиНаценки</name>
    <type>
      <types>CatalogRef.ВидыСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыдатьСкидочныйКупон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДисконтныйКлуб</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоляКомпенсации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеСкидкиНаценки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсключаетБонусныеБаллы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПодарковИзКорзиныПокупателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МоментВыдачиСообщения</name>
    <type>
      <types>EnumRef.ТочкиВыдачиСообщенияКассиру</types>
    </type>
  </attributes>
  <attributes>
    <name>НачислятьНаАкционныеТовары</name>
    <comment>Начислять скидку на товары с признаком &quot;АкционнаяЦена&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураСкидочногоКупона</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьПредоставления</name>
    <type>
      <types>EnumRef.ВариантыОбластейОграниченияСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечататьСерийныйНомер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодарокИзКорзиныПокупателя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодарокИзСписка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаЛояльности</name>
    <type>
      <types>CatalogRef.ПрограммыЛояльности</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СегментНоменклатурыПредоставления</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПредоставления</name>
    <type>
      <types>EnumRef.СпособыПредоставленияСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПримененияСкидки</name>
    <type>
      <types>EnumRef.СпособыПримененияСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДействия</name>
    <type>
      <types>EnumRef.СтатусыДействияСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстУсловияДляПечатиВЧекеККМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКомпенсации</name>
    <type>
      <types>EnumRef.ТипКомпенсации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСкидкиНаценки</name>
    <type>
      <types>EnumRef.ТипСкидкиНаценки</types>
    </type>
  </attributes>
  <attributes>
    <name>Управляемая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчаствуетВПереоценке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПодарокКакПродажу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаПодарка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЧека</name>
    <type>
      <types>CatalogRef.ШаблоныЧеков</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДиапазонПроцентов</name>
    <attributes>
      <name>КоличествоСегментов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КомплекснаяПокупка</name>
    <attributes>
      <name>СтрокаТоваров</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборПодарков</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УсловияПредоставления</name>
    <attributes>
      <name>УсловиеПредоставления</name>
      <type>
        <types>CatalogRef.УсловияПредоставленияСкидокНаценок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦеновыеГруппы</name>
    <attributes>
      <name>ЦеноваяГруппа</name>
      <type>
        <types>CatalogRef.ЦеновыеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСкидкиНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШкалаКратностей</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.СегментыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Documents/МаркетинговаяАкция/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Процедура ЗаполнитьНаборыЗначенийДоступа заполняет наборы значений доступа
// по объекту в таблице с полями:
//  - НомерНабора     Число                                     (необязательно, если набор один),
//  - ВидДоступа      ПланВидовХарактеристикСсылка.ВидыДоступа, (обязательно),
//  - ЗначениеДоступа Неопределено, СправочникСсылка или др.    (обязательно),
//  - Чтение          Булево (необязательно, если набор для всех прав; устанавливается для одной строки набора),
//  - Добавление      Булево (необязательно, если набор для всех прав; устанавливается для одной строки набора),
//  - Изменение       Булево (необязательно, если набор для всех прав; устанавливается для одной строки набора),
//  - Удаление        Булево (необязательно, если набор для всех прав; устанавливается для одной строки набора).
//
//  Вызывается из процедуры УправлениеДоступом.ЗаписатьНаборыЗначенийДоступа(),
// если объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьНаборыЗначенийДоступа" и
// из таких же процедур объектов, у которых наборы значений доступа зависят от наборов этого
// объекта (в этом случае объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьЗависимыеНаборыЗначенийДоступа").
//
// Параметры:
//  Таблица      - ТабличнаяЧасть,
//                 РегистрСведенийНаборЗаписей.НаборыЗначенийДоступа,
//                 ТаблицаЗначений, возвращаемая УправлениеДоступом.ТаблицаНаборыЗначенийДоступа().
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения следующая:
	// объект доступен, если доступны все магазины и скидки
	// 
	
	Для Каждого СтрокаТаблицы Из Магазины Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Магазин) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТаб = Таблица.Добавить();
		СтрокаТаб.ВидДоступа      = ПланыВидовХарактеристик.ВидыДоступа.Магазины;
		СтрокаТаб.ЗначениеДоступа = СтрокаТаблицы.Магазин;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(СкидкиНаценки.СкидкаНаценка КАК Справочник.СкидкиНаценки) КАК СкидкаНаценка
	|ПОМЕСТИТЬ ТаблицаСкидок
	|ИЗ
	|	&СкидкиНаценки КАК СкидкиНаценки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаСкидок.СкидкаНаценка.ВидЦены КАК ВидЦены
	|ИЗ
	|	ТаблицаСкидок КАК ТаблицаСкидок
	|ГДЕ
	|	(НЕ ТаблицаСкидок.СкидкаНаценка.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка))";
	
	Запрос.УстановитьПараметр("СкидкиНаценки", СкидкиНаценки.Выгрузить());
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаТаб = Таблица.Добавить();
		СтрокаТаб.ВидДоступа      = ПланыВидовХарактеристик.ВидыДоступа.ВидыЦен;
		СтрокаТаб.ЗначениеДоступа = Выборка.ВидЦены;
		
	КонецЦикла;
	
	
	Если Таблица.Количество() = 0 Тогда
	
		СтрокаТаб = Таблица.Добавить();
		СтрокаТаб.Чтение          = Истина;
		СтрокаТаб.Добавление      = Истина;
		СтрокаТаб.Изменение       = Истина;
		СтрокаТаб.ВидДоступа      = ПланыВидовХарактеристик.ВидыДоступа.Магазины;
		СтрокаТаб.ЗначениеДоступа = Справочники.Магазины.ПустаяСсылка();
		
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	Документы.МаркетинговаяАкция.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	МаркетинговыеАкцииСервер.ОтразитьДействиеСкидокНаценок(ДополнительныеСвойства, Движения, Отказ);

	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты);
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ДляВсехМагазинов Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Магазины");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	МаркетинговыеАкцииСервер.ПроверитьЗаполнениеДокументаМаркетинговаяАкция(
		ЭтотОбъект,
		Отказ
	);
	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
//	LNK 16.02.2017 14:33:05
	ЗаполнениеОбъектовСобытия.ОбщиеДействияПередЗаписью(ЭтотОбъект, Отказ);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	Если  ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() Тогда
		Если НЕ ЭтоНовый() тогда 
			Если  Ссылка.ДатаОкончанияДействия > ТекущаяДата() или ДатаОкончанияДействия > ТекущаяДата() тогда
				УстановитьПривилегированныйРежим(Истина);
				Если Ссылка.ДатаНачалаДействия <> ДатаНачалаДействия ИЛИ Ссылка.ДатаОкончанияДействия <> ДатаОкончанияДействия  тогда
						СделатьЗаписьПоДате();	
				Иначе		
					Если НЕ Ссылка.ДляВсехМагазинов = ДляВсехМагазинов тогда
						Если  ДляВсехМагазинов = Ложь тогда
							СделатьЗаписьДляВсехМагазинов();
						Иначе
							СдлеатьЗаписьДляВыбранныхМагазинов();
						КонецЕсли;   					
					ИначеЕсли ДляВсехМагазинов = Ложь тогда 
					 СравнитьТЧ();	
					КонецЕсли;
				 КонецЕсли;
				УстановитьПривилегированныйРежим(Ложь);
			 КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;	

	Если ОбщегоНазначенияРТСервер.РазрешеноИзменениеВУзле(ЭтотОбъект, Отказ) Тогда

	//	LNK 27.09.2017 15:30:43
		Возврат;

	КонецЕсли;
	
	ПроведениеСервер.УстановитьРежимПроведения(Проведен, РежимЗаписи, РежимПроведения);

	Если НЕ ДляВсехМагазинов И ИспользоватьИнтернетМагазин Тогда

		ИспользоватьИнтернетМагазин = Ложь;

	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьДокумент();
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

///////////////////////////////////////////////////////////////////////////////
// Инициализация и заполнение

// Инициализирует документ
//
Процедура ИнициализироватьДокумент()
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если  ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() Тогда
		Если ДополнительныеСвойства.ЭтоНовый тогда 
			УстановитьПривилегированныйРежим(Истина);			
			Для каждого УзелПолучатель Из ОбменBigQueryПовтИсп.ПолучитьМассивУзлов() Цикл
				  ПланыОбмена.ЗарегистрироватьИзменения(УзелПолучатель, Ссылка);
			КонецЦикла;
			УстановитьПривилегированныйРежим(Ложь);			
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

Процедура ЗапросПоДобавленнымМазазинам(ТЧМагазины)
	
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Организация = ОбщегоНазначенияРТ.ПолучитьУчетнуюПолитику().ОсновнаяОрганизация;

	Если НЕ ЗначениеЗаполнено(Организация) Тогда

		Организация = Справочники.Организации.ПолучитьОрганизациюПоУмолчанию();

	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧМагазины.Магазин КАК Магазин
		|ПОМЕСТИТЬ ТЧМагазины
		|ИЗ
		|	&ТЧМагазины КАК ТЧМагазины
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Магазин
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Магазины.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВсеМагазины
		|ИЗ
		|	Справочник.Магазины КАК Магазины
		|ГДЕ
		|	Магазины.ВведенВЭксплуатацию = ИСТИНА
		|	И Магазины.Организация = &Организация
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеМагазины.Ссылка,
		|	ТЧМагазины.Магазин
		|ПОМЕСТИТЬ ТабСравнениямагазинов
		|ИЗ
		|	ВсеМагазины КАК ВсеМагазины
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТЧМагазины КАК ТЧМагазины
		|		ПО ВсеМагазины.Ссылка = ТЧМагазины.Магазин
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабСравнениямагазинов.Ссылка КАК Магазин
		|ИЗ
		|	ТабСравнениямагазинов КАК ТабСравнениямагазинов
		|ГДЕ
		|	ТабСравнениямагазинов.Магазин = NULL";
	
	Запрос.УстановитьПараметр("ТчМагазины", ДополнительныеСвойства.ТЧМагазины);  	
	Запрос.УстановитьПараметр("Организация", Организация);  		
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СделатьЗаписьВДатаИзмененияСегментов(ВыборкаДетальныеЗаписи.Магазин);
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	
КонецПроцедуры


Процедура СделатьЗаписьВДатаИзмененияСегментов(Магазин);
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураСегмента.Номенклатура
		|ИЗ
		|	Документ.МаркетинговаяАкция.СкидкиНаценки КАК МаркетинговаяАкцияСкидкиНаценки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
		|		ПО МаркетинговаяАкцияСкидкиНаценки.СкидкаНаценка.СегментНоменклатурыПредоставления = НоменклатураСегмента.Сегмент
		|ГДЕ
		|	МаркетинговаяАкцияСкидкиНаценки.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ДатаИзмененияСегментов.СоздатьНаборЗаписей(); 

		НаборЗаписей.Отбор.Номенклатура.Установить(ВыборкаДетальныеЗаписи.Номенклатура);
		НаборЗаписей.Отбор.Магазин.Установить(Магазин);

		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Магазин = Магазин;
		НоваяЗапись.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		НоваяЗапись.Дата = ТекущаяДатаСеанса(); 

		НаборЗаписей.Записать();	
	КонецЦикла;
	
	
	
	
КонецПроцедуры


Процедура  СделатьЗаписьПоДате()
	Если ДляВсехМагазинов тогда  
		Если ДляВсехМагазинов  = Ссылка.ДляВсехМагазинов тогда 
			СделеатьПросутюЗапись();
		Иначе
			СдлеатьЗаписьДляВыбранныхМагазинов_ПлюсИзменениеДаты();
		КонецЕсли;		
	Иначеесли ДляВсехМагазинов = Ложь тогда
		Если ДляВсехМагазинов  = Ссылка.ДляВсехМагазинов тогда 
			СдлеатьЗаписьДляВыбранныхМагазинов_ПлюсИзменениеДаты2();
		Иначе
			СделатьЗаписьДляВсехМагазинов_ПлюсИзменениеДаты();
		КонецЕсли;		
	КонецЕсли;	
КонецПроцедуры

Процедура СделеатьПросутюЗапись()
	СделатьЗаписьВРегистр(ТекущаяДата(),Справочники.Магазины.ПустаяСсылка(),"delete",Ссылка.ДатаНачалаДействия,Ссылка.ДатаОкончанияДействия);
	Если ДатаОкончанияДействия > НачалоДня(ТекущаяДата()) тогда
		СделатьЗаписьВРегистр(ТекущаяДата(),Справочники.Магазины.ПустаяСсылка(),"create",ДатаНачалаДействия,ДатаОкончанияДействия);
 	КонецЕсли;
КонецПроцедуры

Процедура СравнитьТЧ();
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
				"ВЫБРАТЬ
				|	ТЧ.Магазин КАК Магазин
				|ПОМЕСТИТЬ ТЧпосле
				|ИЗ
				|	&ТЧпосле КАК ТЧ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ТЧ.Магазин КАК Магазин
				|ПОМЕСТИТЬ ТЧдо
				|ИЗ
				|	&ТЧдо КАК ТЧ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ТЧдо.Магазин КАК Магазин,
				|	ТЧпосле.Магазин КАК Магазин1
				|ИЗ
				|	ТЧдо КАК ТЧдо
				|		ЛЕВОЕ СОЕДИНЕНИЕ ТЧпосле КАК ТЧпосле
				|		ПО ТЧдо.Магазин = ТЧпосле.Магазин
				|ГДЕ
				|	ТЧпосле.Магазин ЕСТЬ NULL
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ТЧдо
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ТЧпосле";
				
				
				
				
							
	Запрос.УстановитьПараметр("ТЧдо",Ссылка.Магазины.Выгрузить());
	Запрос.УстановитьПараметр("ТЧпосле",Магазины.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СделатьЗаписьВРегистр(ТекущаяДата(),ВыборкаДетальныеЗаписи.Магазин,"delete",Ссылка.ДатаНачалаДействия,Ссылка.ДатаОкончанияДействия);
		Если Ссылка.ДатаНачалаДействия <= ТекущаяДата()	тогда	
			СделатьЗаписьВРегистр(ТекущаяДата(),ВыборкаДетальныеЗаписи.Магазин,"create",Ссылка.ДатаНачалаДействия,ТекущаяДата())
		КонецЕсли;	
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
				"ВЫБРАТЬ
				|	ТЧ.Магазин КАК Магазин
				|ПОМЕСТИТЬ ТЧпосле
				|ИЗ
				|	&ТЧпосле КАК ТЧ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ТЧ.Магазин КАК Магазин
				|ПОМЕСТИТЬ ТЧдо
				|ИЗ
				|	&ТЧдо КАК ТЧ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ТЧпосле.Магазин КАК Магазин
				|ИЗ
				|	ТЧпосле КАК ТЧпосле
				|		ЛЕВОЕ СОЕДИНЕНИЕ ТЧдо КАК ТЧдо
				|		ПО ТЧпосле.Магазин = ТЧдо.Магазин
				|ГДЕ
				|	ТЧдо.Магазин ЕСТЬ NULL
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ТЧдо
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ТЧпосле";
	Запрос.УстановитьПараметр("ТЧдо",Ссылка.Магазины.Выгрузить());
	Запрос.УстановитьПараметр("ТЧпосле",Магазины.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СделатьЗаписьВРегистр(ТекущаяДата(),ВыборкаДетальныеЗаписи.Магазин,"create",Ссылка.ДатаНачалаДействия,Ссылка.ДатаОкончанияДействия)
	КонецЦикла;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
КонецПроцедуры

Процедура СравнитьТЧ_ПлюсИзменениеДаты();
		Если Ссылка.ДатаНачалаДействия <= ТекущаяДата() тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ТЧ.Магазин КАК Магазин
				|ПОМЕСТИТЬ ТЧпосле
				|ИЗ
				|	&ТЧпосле КАК ТЧ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ТЧ.Магазин КАК Магазин
				|ПОМЕСТИТЬ ТЧдо
				|ИЗ
				|	&ТЧдо КАК ТЧ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ТЧдо.Магазин КАК Магазин,
				|	ТЧпосле.Магазин КАК Магазин1
				|ИЗ
				|	ТЧдо КАК ТЧдо
				|		ЛЕВОЕ СОЕДИНЕНИЕ ТЧпосле КАК ТЧпосле
				|		ПО ТЧдо.Магазин = ТЧпосле.Магазин
				|ГДЕ
				|	ТЧпосле.Магазин ЕСТЬ NULL
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ТЧдо
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ТЧпосле";
			Запрос.УстановитьПараметр("ТЧСсылка",Ссылка.Магазины.Выгрузить());
			Запрос.УстановитьПараметр("ТЧ",Магазины.Выгрузить());
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				СделатьЗаписьВРегистр(ТекущаяДата(),ВыборкаДетальныеЗаписи.Магазин,"delete",Ссылка.ДатаНачалаДействия,Ссылка.ДатаОкончанияДействия);
				СделатьЗаписьВРегистр(ТекущаяДата(),ВыборкаДетальныеЗаписи.Магазин,"create",Ссылка.ДатаНачалаДействия,ТекущаяДата());
			КонецЦикла;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ТЧ.Магазин КАК Магазин
				|ПОМЕСТИТЬ ТЧпосле
				|ИЗ
				|	&ТЧпосле КАК ТЧ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ТЧ.Магазин КАК Магазин
				|ПОМЕСТИТЬ ТЧдо
				|ИЗ
				|	&ТЧдо КАК ТЧ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ТЧпосле.Магазин КАК Магазин
				|ИЗ
				|	ТЧпосле КАК ТЧпосле
				|		ЛЕВОЕ СОЕДИНЕНИЕ ТЧдо КАК ТЧдо
				|		ПО ТЧпосле.Магазин = ТЧдо.Магазин
				|ГДЕ
				|	ТЧдо.Магазин ЕСТЬ NULL
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ТЧдо
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ТЧпосле";
				
			Запрос.УстановитьПараметр("ТЧСсылка",Ссылка.Магазины.Выгрузить());
			Запрос.УстановитьПараметр("ТЧ",Магазины.Выгрузить());
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				СделатьЗаписьВРегистр(ТекущаяДата(),ВыборкаДетальныеЗаписи.Магазин,"create",ДатаНачалаДействия,ДатаОкончанияДействия);
			КонецЦикла;
			
			
		Иначе
			Для каждого строка из  Ссылка.Магазины цикл
				СделатьЗаписьВРегистр(ТекущаяДата(),строка.Магазин,"delete",Ссылка.ДатаНачалаДействия,Ссылка.ДатаОкончанияДействия);
			КонецЦикла;
			Для каждого строка из  Магазины цикл
				СделатьЗаписьВРегистр(ТекущаяДата(),строка.Магазин,"delete",ДатаНачалаДействия,ДатаОкончанияДействия);
			КонецЦикла;
		КонецЕсли;
	
	
	
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецПроцедуры

Процедура  СделатьЗаписьДляВсехМагазинов_ПлюсИзменениеДаты()  	// Было для всех магазинов стало для списка
	СделатьЗаписьВРегистр(ТекущаяДата(),Справочники.Магазины.ПустаяСсылка(),"delete",Ссылка.ДатаНачалаДействия,Ссылка.ДатаОкончанияДействия);
	Если Ссылка.ДатаНачалаДействия <= ТекущаяДата()	тогда	
		СделатьЗаписьВРегистр(ТекущаяДата(),Справочники.Магазины.ПустаяСсылка(),"create",Ссылка.ДатаНачалаДействия,ТекущаяДата());
	КонецЕсли;
	Если ДатаОкончанияДействия > НачалоДня(ТекущаяДата()) тогда
		Для каждого строка из  Ссылка.Магазины цикл
			СделатьЗаписьВРегистр(ТекущаяДата(),строка.Магазин,"create",ДатаНачалаДействия,ДатаОкончанияДействия);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура  СдлеатьЗаписьДляВыбранныхМагазинов_ПлюсИзменениеДаты()  

	Для каждого строка из  Ссылка.Магазины цикл
		СделатьЗаписьВРегистр(ТекущаяДата(),строка.Магазин,"delete",Ссылка.ДатаНачалаДействия,Ссылка.ДатаОкончанияДействия);
	КонецЦикла;
		
	Если ДатаНачалаДействия <= ТекущаяДата() тогда 
		Для каждого строка из  Ссылка.Магазины цикл
			СделатьЗаписьВРегистр(ТекущаяДата(),строка.Магазин,"create",ДатаНачалаДействия,ТекущаяДата());
		КонецЦикла;
	КонецЕсли;
	
	Если ДатаОкончанияДействия > НачалоДня(ТекущаяДата()) тогда
		СделатьЗаписьВРегистр(ТекущаяДата(),строка.Магазин,"create",ДатаНачалаДействия,ДатаОкончанияДействия);
	КонецЕсли;
КонецПроцедуры


Процедура  СдлеатьЗаписьДляВыбранныхМагазинов_ПлюсИзменениеДаты2()  // Было для для списка стало всех магазинов  
	
	Для каждого строка из  Ссылка.Магазины цикл
		СделатьЗаписьВРегистр(ТекущаяДата(),строка.Магазин,"delete",Ссылка.ДатаНачалаДействия,Ссылка.ДатаОкончанияДействия);
	КонецЦикла;
		
	Если Ссылка.ДатаОкончанияДействия <= ТекущаяДата() тогда 
		Для каждого строка из  Ссылка.Магазины цикл
			СделатьЗаписьВРегистр(ТекущаяДата(),строка.Магазин,"create",ДатаНачалаДействия,ТекущаяДата());
		КонецЦикла;
	КонецЕсли;
	
	Если ДатаОкончанияДействия > НачалоДня(ТекущаяДата()) тогда
		Для каждого строка из  Магазины цикл
			СделатьЗаписьВРегистр(ТекущаяДата(),строка.Магазин,"create",ДатаНачалаДействия,ДатаОкончанияДействия);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры



Процедура  СдлеатьЗаписьДляВыбранныхМагазинов()  	// Было для для списка стало всех магазинов  

	Для каждого строка из  Ссылка.Магазины цикл
		СделатьЗаписьВРегистр(ТекущаяДата(),строка.Магазин,"delete",ДатаНачалаДействия,ДатаОкончанияДействия);
	КонецЦикла;
		
	Если ДатаНачалаДействия <= ТекущаяДата() тогда 
		Для каждого строка из  Ссылка.Магазины цикл
			СделатьЗаписьВРегистр(ТекущаяДата(),строка.Магазин,"create",ДатаНачалаДействия,ТекущаяДата());
		КонецЦикла;
	КонецЕсли;
	Если ДатаОкончанияДействия > НачалоДня(ТекущаяДата()) тогда
		СделатьЗаписьВРегистр(ТекущаяДата(),Справочники.Магазины.ПустаяСсылка(),"create",ДатаНачалаДействия,ДатаОкончанияДействия);
	КонецЕсли;
КонецПроцедуры


Процедура  СделатьЗаписьДляВсехМагазинов()	// Было для всех магазинов стало для списка
	СделатьЗаписьВРегистр(ТекущаяДата(),Справочники.Магазины.ПустаяСсылка(),"delete",ДатаНачалаДействия,ДатаОкончанияДействия);
	
	Если ДатаНачалаДействия <= ТекущаяДата() тогда 
		СделатьЗаписьВРегистр(ТекущаяДата(),Справочники.Магазины.ПустаяСсылка(),"delete",ДатаНачалаДействия,ТекущаяДата());
	КонецЕсли;
		
	Если ДатаОкончанияДействия > НачалоДня(ТекущаяДата()) тогда
		Для каждого строка из  Магазины цикл
			СделатьЗаписьВРегистр(ТекущаяДата(),строка.Магазин,"create",ДатаНачалаДействия,ДатаОкончанияДействия);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


Процедура СделатьЗаписьВРегистр(ТекДата,Магазин,Действие,ТекДатаНачалаДействия,ТекДатаОкончанияДействия)

	НаборЗаписей = РегистрыСведений.ОбъектыДляОбработкиBigQuery.СоздатьНаборЗаписей(); 

	НаборЗаписей.Отбор.Объект.Установить(Ссылка);
	НаборЗаписей.Отбор.Период.Установить(ТекДата); 
	НаборЗаписей.Отбор.Магазин.Установить(Магазин); 
	НаборЗаписей.Отбор.ДатаНачалаДействия.Установить(ТекДатаНачалаДействия); 
	НаборЗаписей.Отбор.ДатаОкончанияДействия.Установить(ТекДатаОкончанияДействия); 
	
	НовЗапись = НаборЗаписей.Добавить();
	НовЗапись.Магазин = Магазин;
	НовЗапись.Период = ТекДата;
	НовЗапись.Объект = Ссылка;
	НовЗапись.action = Действие; 
	НовЗапись.ДатаНачалаДействия = ТекДатаНачалаДействия; 
	НовЗапись.ДатаОкончанияДействия = ТекДатаОкончанияДействия; 
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры
